src/cf/InformationRegisters/ИндексыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИндексыНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ТТС_Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЯзыка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВДокументах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПереписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПерепискеСРангом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенныеВебСерверы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/WebServices/DMReg/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует документ в системе и возвращает рег. данные.
//
// Параметры:
//  DocumentInfo - ОбъектXDTO - Структура, содержащиая данные регистрационного документа.
// 
// Возвращаемое значение:
// 	тип XDTO - рег. данные или информация об ошибке
//
Функция RegisterDocument(DocumentInfo) Экспорт
	
	Попытка
		
		Возврат ЗарегистрироватьДокумент(DocumentInfo);
		
	Исключение
		
		DMRegError = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.1c.ru/DMReg", "DMRegError"));
		DMRegError.Subject = НСтр("ru = 'Ошибка при регистрации документа'");
		DMRegError.Description = ОписаниеОшибки();
		Возврат DMRegError;
		
	КонецПопытки;
	
КонецФункции

Функция GetNewBarCodeNum()

	Попытка
		
		Возврат ШтрихкодированиеСервер.ОчереднойНомер();
		
	Исключение
		
		DMRegError = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.1c.ru/DMReg", "DMRegError"));
		DMRegError.Subject = НСтр("ru = 'Ошибка при получении нового значения штрихкода'");
		DMRegError.Description = ОписаниеОшибки();
		Возврат DMRegError;
		
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗарегистрироватьДокумент(DocumentInfo)
	
	Если DocumentInfo.Тип() <> ФабрикаXDTO.Тип("http://www.1c.ru/DMReg", "DMDocumentInfo") Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка вызова веб-сервиса. Обратитесь к администратору'");
	КонецЕсли;
	Зарегистрировал = Сотрудники.ОсновнойСотрудник();
	Если ЗначениеЗаполнено(DocumentInfo.RegisteredByID) Тогда 
		СсылкаНаЗарегистрировал = Справочники.Пользователи.ПолучитьСсылку(
			Новый УникальныйИдентификатор(DocumentInfo.RegisteredByID));
		
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаЗарегистрировал) Тогда
			Зарегистрировал = Сотрудники.ОсновнойСотрудникПользователя(СсылкаНаЗарегистрировал);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Зарегистрировал) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен регистратор документа. Обратитесь к администратору'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		СсылкаДокумент = НайтиСоздатьДокумент(DocumentInfo.DocumentID,
			DocumentInfo.DocumentName, DocumentInfo.DocumentHeader);
		ДокументОбъект = СсылкаДокумент.ПолучитьОбъект();
		
		ТребуетсяЗапись = Ложь;
		Если DocumentInfo.DocumentTypeID <> 
			СокрЛП(ОбщегоНазначенияДокументооборотКлиентСервер.ПустойУникальныйИдентификатор()) Тогда 
			ВидДокумента = СоздатьЗаполнитьДанныеДляДокумента(
				DocumentInfo.DocumentTypeID, "ВидыДокументов", "ВидДокумента",
				ДокументОбъект, ТребуетсяЗапись, DocumentInfo.DocumentTypeIndex);
		Иначе 
			ВидДокумента = МиграцияДанныхИзВнешнихСистемДО21.НайтиСоздатьВидДокумента(
				DocumentInfo.DocumentClass);
		КонецЕсли;
		
		НоменклатураДел = СоздатьЗаполнитьДанныеДляДокумента(
			DocumentInfo.CaseFileCatalogID, "НоменклатураДел", "НоменклатураДел",
			ДокументОбъект, ТребуетсяЗапись, DocumentInfo.CaseFileCatalogIndex);
		Организация = СоздатьЗаполнитьДанныеДляДокумента(
			DocumentInfo.CompanyID, "Организации", "Организация",
			ДокументОбъект, ТребуетсяЗапись, DocumentInfo.CompanyIndex);
		Контрагент = СоздатьЗаполнитьДанныеДляДокумента(
			DocumentInfo.CounterpartyByID, "Контрагенты", "Контрагент",
			ДокументОбъект, ТребуетсяЗапись, DocumentInfo.CounterpartyIndex);
		Подразделение = СоздатьЗаполнитьДанныеДляДокумента(
			DocumentInfo.DepartmentID, "СтруктураПредприятия", "Подразделение",
			ДокументОбъект, ТребуетсяЗапись, DocumentInfo.DepartmentIndex);
		Проект = СоздатьЗаполнитьДанныеДляДокумента(
			DocumentInfo.ProjectByID, "Проекты", "Проект",
			ДокументОбъект, ТребуетсяЗапись, DocumentInfo.ProjectByIndex);
			
		Ответственный = Справочники.Сотрудники.ПустаяСсылка();
		Если ЗначениеЗаполнено(DocumentInfo.ResponsibleID) Тогда 
			СсылкаНаОтветственный = Справочники.Пользователи.ПолучитьСсылку(
				Новый УникальныйИдентификатор(DocumentInfo.ResponsibleID));
			
			Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаОтветственный) Тогда
				Ответственный = Сотрудники.ОсновнойСотрудникПользователя(СсылкаНаОтветственный);
				
				Если ДокументОбъект.Ответственный <> Ответственный Тогда 
					ТребуетсяЗапись = Истина;
				КонецЕсли;
			КонецЕсли;
			Индекс = DocumentInfo.ResponsibleIndex;
			// Если заполнен индекс, то запишем его тоже, чтобы он смог участвовать в нумерации
			Если ЗначениеЗаполнено(Индекс) И ЗначениеЗаполнено(Ответственный) Тогда
				Если РегистрыСведений.ИндексыНумерации.ПолучитьИндексНумерации(Ответственный) <> Индекс Тогда
					РегистрыСведений.ИндексыНумерации.ЗаписатьИндексНумерации(Ответственный, Индекс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТребуетсяЗапись Тогда
			ДокументОбъект.ВидДокумента = ВидДокумента;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.Подразделение = Подразделение;
			ДокументОбъект.Проект = Проект;
			ДокументОбъект.Контрагент = Контрагент;
			ДокументОбъект.НоменклатураДел = НоменклатураДел;
			ДокументОбъект.Наименование = DocumentInfo.DocumentName;
			ДокументОбъект.Заголовок = DocumentInfo.DocumentHeader;
			ДокументОбъект.Ответственный = Ответственный;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			ДокументОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьОбъектаИзДругойСистемы", Истина);
			ДокументОбъект.Записать();
		КонецЕсли;
		
		ТекстОшибки = "";
		
		ПараметрыРегистрации = Новый Структура;
		ПараметрыРегистрации.Вставить("Зарегистрировал", Зарегистрировал);
		
		// Запись связанного документа
		Если ЗначениеЗаполнено(DocumentInfo.RelatedDocumentID) Тогда 
			СвязанныйДокумент = НайтиСоздатьДокумент(DocumentInfo.RelatedDocumentID,,,
				DocumentInfo.RelatedDocumentNumber);
			Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда 
				ПараметрыРегистрации.Вставить("СвязанныйОбъект", СвязанныйДокумент);
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыРегистрации.Вставить("РазрешитьЗаписьОбъектаИзДругойСистемы", Истина);
		ПараметрыРегистрации.Вставить("ДатаРегистрации", DocumentInfo.Date);
		Если Не Делопроизводство.ЗарегистрироватьПредмет(СсылкаДокумент, ТекстОшибки,, ПараметрыРегистрации) Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Реквизиты = Новый Структура("РегистрационныйНомер, ДатаРегистрации, ЧисловойНомер");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаДокумент, Реквизиты);
	
	DMRegNum = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.1c.ru/DMReg", "DMRegNum"));
	DMRegNum.Number = ЗначенияРеквизитов.РегистрационныйНомер;
	DMRegNum.Date = ЗначенияРеквизитов.ДатаРегистрации;
	DMRegNum.DigitalNumber = ЗначенияРеквизитов.ЧисловойНомер;
	Возврат DMRegNum;
	
КонецФункции

Функция СоздатьЗаполнитьДанныеДляДокумента(ID, ИмяОбъекта, ИмяРеквизита, Документ, ТребуетсяЗапись, Индекс)
	
	СсылкаНаОбъект = Неопределено;
	Если ЗначениеЗаполнено(ID) Тогда 
		СсылкаНаОбъект = Справочники[ИмяОбъекта].ПолучитьСсылку(
			Новый УникальныйИдентификатор(ID));
		
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
			Если Документ[ИмяРеквизита] <> СсылкаНаОбъект Тогда 
				ТребуетсяЗапись = Истина;
			КонецЕсли;
		Иначе
			НовыйОбъект = Справочники[ИмяОбъекта].СоздатьЭлемент();
			НовыйОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
			НовыйОбъект.ОбменДанными.Загрузка = Истина;
			НовыйОбъект.Записать();
			ТребуетсяЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	// Если заполнен индекс, то запишем его тоже, чтобы он смог участвовать в нумерации
	Если ЗначениеЗаполнено(Индекс) И ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Если РегистрыСведений.ИндексыНумерации.ПолучитьИндексНумерации(СсылкаНаОбъект) <> Индекс Тогда
			РегистрыСведений.ИндексыНумерации.ЗаписатьИндексНумерации(СсылкаНаОбъект, Индекс);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

Функция НайтиСоздатьДокумент(DocumentID, 
	Наименование = Неопределено, Заголовок = Неопределено, РегНомер = Неопределено)
	
	СсылкаДокумент = Справочники.ДокументыПредприятия.ПолучитьСсылку(
		Новый УникальныйИдентификатор(DocumentID));
			
	ДокументСуществует = ОбщегоНазначения.СсылкаСуществует(СсылкаДокумент);
	Если Не ДокументСуществует Тогда
		ДокументОбъект = Справочники.ДокументыПредприятия.СоздатьЭлемент();
		ДокументОбъект.УстановитьСсылкуНового(СсылкаДокумент);
		ДокументОбъект.ИсточникДанных = Справочники.ИсточникиДанных.ДО21;
		Если ЗначениеЗаполнено(Наименование) Тогда 
			ДокументОбъект.Наименование = Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(Заголовок) Тогда 
			ДокументОбъект.Заголовок = Заголовок;
		КонецЕсли;
		Если ЗначениеЗаполнено(РегНомер) Тогда 
			ДокументОбъект.РегистрационныйНомер = РегНомер;
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		ДокументОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьОбъектаИзДругойСистемы", Истина);
		ДокументОбъект.Записать();
	КонецЕсли;
	
	Возврат СсылкаДокумент;
	
КонецФункции

#КонецОбласти
